app/controllers/home_controller.rb

  def index
    @post = Post.new
    @friends = @user.all_following.unshift(@user)
    @activities = PublicActivity::Activity.all
---
SELECT "activities".* FROM "activities"

  def front
    @activities = PublicActivity::Activity.all
---
SELECT "activities".* FROM "activities"  ORDER BY "activities"."created_at" DESC