app/controllers/pages_controller.rb

SELECT "activities".* FROM "activities"
---
  def index
    @activities = PublicActivity::Activity.all