app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "The Great Gatsby is my favorite book"], ["user_id", 4], ["created_at", "2016-05-02 05:30:07.870552"], ["updated_at", "2016-05-02 05:30:07.870552"]]
---
  def create
    @post = Post.new(post_params) do |post|
      post.user = current_user
    end
    if @post.save